IA-2023/Practicas/Práctica No. 1 Laboratorio/inv.tex
% Created 2023-08-23 mié 12:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{../modern}
\bibliography{../sample.bib}
\raggedbottom
\setcounter{secnumdepth}{2}
\author{Luis Eduardo Galidno Amaya}
\date{22 de Agosto del 2023}
\title{Práctica No. 1 Laboratorio}
\hypersetup{
 pdfauthor={Luis Eduardo Galidno Amaya},
 pdftitle={Práctica No. 1 Laboratorio},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={Spanish}}
\begin{document}

\modentitlepage{../images/escudo-uabc-2022-1-tinta-pos.png}
\datasection{Individual}

\section{Estado Actual}
\label{sec:orgbdcfa0d}
La inteligencia artificial es bastante moderna, como la mayoría del áreas de 
computación, pero sus orígenes se pueden remontar a los inicios de la 
computación moderna tomando diversas formas, ajustándose a las necesidades y a 
la disponibilidad técnica de su tiempo. La mayoría de sistemas de IA que han 
existido se han enfocado en sistemas en sistemas para inferir o buscar 
resultados de manera eficiente por otro lado los sistemas modernos de 
inteligencia artificial utilizan redes neuronales para resolver los problemas 
haciéndolos mas costosos computacional mente pero aumentando su versatilidad 
y capacidades más allá de lo que se había visto hasta ahora.


\section{Objetivos Ideales Y La Relidad De La IA}
\label{sec:orgb378cc1}
El área de inteligencia artificial busca construir maquinas capaces de imitar 
el pensamiento animal o humano. Hasta el momento \textbf{NO} existe una inteligencia
artificial imitar el pensamiento por lo tanto los objetivos del área no se han 
cumplido, sin embargo los avances en años recientes han probado el valor de 
aplicación en sistemas específicos, las IAs de dominio especifico pueden
asistir a los operadores humanos en tarea complicadas.


\section{Implicaciones Éticas}
\label{sec:org89df24a}
Los últimos años han sido bastante importantes para el desarrollo de la IA el
fácil accesos a potentes modelos ha permitido encontrar nuevos usos pero 
también nuevos problemas, diversos tipos de IAs dan diferentes varios tipos de 
problemas algunos de los mas importantes son la incapacidad de diferenciar 
la realidad de lo falso o inventar cosas, utilización de información extraída de 
maneras poco éticas, un ejemplo de esto seria los modelos como Midjourney y 
dall-e que utilizan imágenes o dibujos sin permiso de los autores.


\section{Aplicaciones}
\label{sec:orgf856581}
\subsection{Hogar}
\label{sec:org2f8b1ca}
Actualmente se utiliza la inteligencia en sistemas de reconocimiento de voz en
dispositivos como Amazon Alexa o Google Home, pero en el futuro se podrán 
sistemas incluso mas avanzados que podrán gestionar todas las tareas domesticas.

\subsection{Industria}
\label{sec:orgdff6612}
En manofactura la IA pude optimizar diseños creados por operadores humanos o
crear diseños completamente nuevos dados una lista de requerimientos. 

\subsection{Ingenieria de software}
\label{sec:orgce8d798}
Al igual que en la manofactura el uso de inteligencia artificial en la 
ingeniería de software podría optimizar la creación de prototipos funcionales en
base a los datos proporcionados por los usuarios, optimizar interfaces para 
lectores de pantalla par personas invidentes además y pruebas de usabilidad 
automatizadas.

\section{Conclusión}
\label{sec:org44ea214}
\begin{mdframed}
A lo largo de esta practica pude identificar los posibles usos que puede tener 
la inteligencia artificial en las actividades humanas y como todavía, a pesar
de los avances en el campo, tiene muchos retos por solucionar.
\end{mdframed}
\end{document}
